# Testing that my git commit is signed.
zsh git vim curl wget

build-essential
gdb
cmake
bc
clang-format

gnupg2
gparted
gedit
ecryptfs-utils

tree
jq
htop
cloc
screen

inetutils-tools
inetutils-traceroute
net-tools

python3 python3-dev
ipython3

golang

nodejs
npm
jsbeautifier
moreutils

xsel
xclip

cheese

usb-creator-gtk

# nvm into `ubuntu-setup.sh`?
# curl -sL https://raw.githubusercontent.com/nvm-sh/nvm/v0.35.0/install.sh -o install_nvm.sh

default-jdk
gradle

libncurses-dev
libncurses5-dev

podman

openssh-server
x11-apps

meld
gnuplot
plotutils

qrencode
python3-pip
python3-colorama

lcov

zbar-tools

# NOTE(dkorolev): I had troubles with them on the ARM machine.
# android-sdk
# sdkmanager
# scrcpy?

libreoffice-writer
libreoffice-calc

# NOTE(dkorolev): I gave up and gave in, esp. given that Chrome profiles are relatively easy to transfer!
chromium-browser
