zsh git vim curl wget

build-essential
cmake
clang-format

tree
jq
htop
cloc
screen

inetutils-tools
net-tools

python3 python3-dev

golang

nodejs
npm

# nvm into `ubuntu-setup.sh`?
# curl -sL https://raw.githubusercontent.com/nvm-sh/nvm/v0.35.0/install.sh -o install_nvm.sh

default-jdk
gradle

libncurses-dev
libncurses5-dev

podman

openssh-server
x11-apps

meld
gnuplot
plotutils

qrencode
python3-pip
python3-colorama

lcov

android-sdk
sdkmanager

# scrcpy?
