zsh git vim curl wget build-essential cmake
screen
jq
python3 python3-dev
golang nodejs
default-jdk
gradle
libncurses5-dev
podman
tree
x11-apps
libncurses-dev
gnuplot plotutils
openssh-server
meld
qrencode
python3-pip
python3-colorama
lcov
htop
inetutils-tools
net-tools
cloc
clang-format
android-sdk
sdkmanager
